---
kind: method
id: M:Autodesk.Revit.DB.ConnectionValidationWarning.Dispose
source: html/ded1ac78-ab17-9313-ca16-7cb026e01154.htm
---
# Autodesk.Revit.DB.ConnectionValidationWarning.Dispose Method

Releases all resources used by the ConnectionValidationWarning

## Syntax (C#)
```csharp
public void Dispose()
```